In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('supershops.csv - supershops.csv.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [5]:
mean = df.Transport.mean()

In [6]:
df.Transport = df.Transport.fillna(mean)

In [7]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [8]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [9]:
x = df.iloc[:,:-1]

In [10]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [11]:
y = df['Profit']

In [12]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [13]:
dummy = pd.get_dummies(x['Area'], drop_first = True)

In [14]:
dummy.head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [15]:
x = x.drop('Area',axis=1)

In [16]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [17]:
x = pd.concat([x,dummy], axis = 1)

In [35]:
x.head()

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10      1        0
1        162597.70       151377.59  443898.53      0        0
2        153441.51       101145.55  407934.54      0        1
3        144372.41       118671.85  383199.62      1        0
4        142107.34        91391.77  366168.42      0        1

In [19]:
from sklearn.model_selection import train_test_split

In [20]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=.25,random_state=101)

In [21]:
from sklearn.linear_model import LinearRegression

In [22]:
lr = LinearRegression()

In [23]:
lr.fit(xtrain,ytrain)

LinearRegression()

In [24]:
y_pred = lr.predict(xtest)

In [25]:
y_pred

array([ 84915.9583995 , 151768.62810595, 128117.18221593,  88306.75938804,
       125967.45267188, 192827.1403474 , 110634.98115187,  81388.79502109,
        72246.21324332,  46303.2211746 , 119896.42320444, 104197.59285902,
       164066.17792929])

In [26]:
lr.coef_

array([5.93850750e-01, 1.06724915e-01, 1.08724891e-01, 7.15381663e+02,
       4.09360112e+03])

In [27]:
lr.intercept_

31849.794610030105

In [28]:
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score

In [29]:
print('MSE =',mean_squared_error(ytest,y_pred))

MSE = 169051305.63425493

In [30]:
print('MAE =',mean_absolute_error(ytest,y_pred))

MAE = 9833.070616179588

In [31]:
print('RMSE =',np.sqrt(mean_squared_error(ytest,y_pred)))

RMSE = 13001.973143883006

In [32]:
print('R =',r2_score(ytest,y_pred))

R = 0.8887676936566691

In [33]:
lr.score(xtest,ytest)*100

88.8767693656669

In [34]:
lr.score(xtrain,ytrain)*100

89.55041677371797